; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l17_p17_c17_g17_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(person-at person1 loc4)
	(person-at person2 loc8)
	(person-at person3 loc5)
	(person-at person4 loc16)
	(person-at person5 loc14)
	(person-at person6 loc13)
	(person-at person7 loc15)
	(person-at person8 loc14)
	(person-at person9 loc11)
	(person-at person10 loc5)
	(person-at person11 loc3)
	(person-at person12 loc17)
	(person-at person13 loc14)
	(person-at person14 loc15)
	(person-at person15 loc11)
	(person-at person16 loc3)
	(person-at person17 loc10)
	(person-need person1 food)
	(person-need person2 food)
	(person-need person3 food)
	(person-need person4 food)
	(person-need person6 food)
	(person-need person6 medicine)
	(person-need person8 medicine)
	(person-need person9 food)
	(person-need person9 medicine)
	(person-need person10 food)
	(person-need person10 medicine)
	(person-need person11 food)
	(person-need person12 medicine)
	(person-need person13 food)
	(person-need person14 food)
	(person-need person15 food)
	(person-need person17 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person9 medicine)
	(has-content-person person10 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person12 medicine)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person17 food)
))
)

; plan
1. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate17 depot)
   added: (has-crate-drone-arm right crate17)
   goals met: 1 of 18
2. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 1 of 18
3. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 0 of 18
4. (drop-crate loc17 person12 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm right crate17)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 1 of 18
5. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 2 of 18
6. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate16 depot)
   added: (has-crate-drone-arm right crate16)
   goals met: 2 of 18
7. (drone-move depot loc16 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc16)
   goals met: 1 of 18
8. (drop-crate loc16 person4 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person4 food) (empty-arm left)
   goals met: 2 of 18
9. (drone-move loc16 depot drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 depot)
   goals met: 3 of 18
10. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 3 of 18
11. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 2 of 18
12. (drop-crate loc15 person14 crate11 left food drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person14 food) (empty-arm left)
   goals met: 3 of 18
13. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 4 of 18
14. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 4 of 18
15. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 3 of 18
16. (drop-crate loc10 person17 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person17 food) (empty-arm left)
   goals met: 4 of 18
17. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 5 of 18
18. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 5 of 18
19. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 4 of 18
20. (drop-crate loc8 person2 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 5 of 18
21. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 6 of 18
22. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 6 of 18
23. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 5 of 18
24. (drop-crate loc4 person1 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 6 of 18
25. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 7 of 18
26. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 7 of 18
27. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 6 of 18
28. (drop-crate loc3 person11 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 7 of 18
29. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 8 of 18
30. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 8 of 18
31. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 7 of 18
32. (drop-crate loc14 person8 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm right crate16)
   added: (has-content-person person8 medicine) (empty-arm right)
   goals met: 8 of 18
33. (drop-crate loc14 person13 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person13 food) (empty-arm left)
   goals met: 9 of 18
34. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 10 of 18
35. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate15 depot)
   added: (has-crate-drone-arm right crate15)
   goals met: 10 of 18
36. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 10 of 18
37. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 9 of 18
38. (drop-crate loc13 person6 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person6 food) (empty-arm left)
   goals met: 10 of 18
39. (drop-crate loc13 person6 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm right crate15)
   added: (has-content-person person6 medicine) (empty-arm right)
   goals met: 11 of 18
40. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 12 of 18
41. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate14 depot)
   added: (has-crate-drone-arm right crate14)
   goals met: 12 of 18
42. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 12 of 18
43. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 11 of 18
44. (drop-crate loc11 person9 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person9 food) (empty-arm left)
   goals met: 12 of 18
45. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 13 of 18
46. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 13 of 18
47. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 12 of 18
48. (drop-crate loc11 person9 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm right crate14)
   added: (has-content-person person9 medicine) (empty-arm right)
   goals met: 13 of 18
49. (drop-crate loc11 person15 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person15 food) (empty-arm left)
   goals met: 14 of 18
50. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 15 of 18
51. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate13 depot)
   added: (has-crate-drone-arm right crate13)
   goals met: 15 of 18
52. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 15 of 18
53. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 14 of 18
54. (drop-crate loc5 person10 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm right crate13)
   added: (has-content-person person10 medicine) (empty-arm right)
   goals met: 15 of 18
55. (drop-crate loc5 person3 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person3 food) (empty-arm left)
   goals met: 16 of 18
56. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 17 of 18
57. (pick-up-crate crate1 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate1 depot)
   added: (has-crate-drone-arm right crate1)
   goals met: 17 of 18
58. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 16 of 18
59. (drop-crate loc5 person10 crate1 right food drone1)
   deleted: (has-crate-drone-arm right crate1)
   added: (has-content-person person10 food) (empty-arm right)
   goals met: 17 of 18
60. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 18 of 18
